src/test/resources/org/lockss/ws/content/addAuByIdRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/ContentService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://content.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:addAuById>
            <auId>Some-AU_Id</auId>
        </service:addAuById>
    </soapenv:Body>
</soapenv:Envelope>
